In [19]:
import numpy as np
import pandas as pd

In [20]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [21]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [22]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [23]:
data['v1']=range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [24]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [25]:
data=pd.DataFrame({'food':['bacon','pulled_pork','bacon','Pastrami','corned_beef','bacon','pastrami','honey_ham','nova_lox'],
                  'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled_pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned_beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey_ham     5.0
8     nova_lox     6.0

In [26]:
meat_to_animal={
    'bacon':'pig',
    'pulled_pork':'pig',
    'pastrami':'cow',
    'corned_beef':'cow',
    'honey_ham':'pig',
    'nova_lox':'salmon'
}

In [28]:
data['food']=data['food'].str.lower()
data

          food  ounces
0        bacon     4.0
1  pulled_pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned_beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey_ham     5.0
8     nova_lox     6.0

In [31]:
data['animal']=data.food.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled_pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned_beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey_ham     5.0     pig
8     nova_lox     6.0  salmon

In [32]:
data=pd.Series([-1,2,-999,3,-999,6])
data

0     -1
1      2
2   -999
3      3
4   -999
5      6
dtype: int64

In [34]:
data.replace(-999,np.nan)

0   -1.0
1    2.0
2    NaN
3    3.0
4    NaN
5    6.0
dtype: float64

In [35]:
data.replace([-999,2],np.nan)

0   -1.0
1    NaN
2    NaN
3    3.0
4    NaN
5    6.0
dtype: float64

In [44]:
age=[20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,64]
bins=[18,25,35,60,100]
cats=pd.cut(age,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (25, 35], ..., (35, 60], (35, 60], (35, 60], (35, 60], (60, 100]]
Length: 16
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [45]:
cats[1]

Interval(18, 25, closed='right')

In [46]:
cats.codes

array([0, 0, 0, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 3], dtype=int8)

In [47]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [48]:
pd.value_counts(cats)

(35, 60]     7
(25, 35]     5
(18, 25]     3
(60, 100]    1
dtype: int64

In [50]:
df=pd.DataFrame({'key':['b','b','a','c','a','b'],
                'data1':range(6)})
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [52]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [54]:
dummies=pd.get_dummies(df['key'],prefix='bloob')
dummies

   bloob_a  bloob_b  bloob_c
0        0        1        0
1        0        1        0
2        1        0        0
3        0        0        1
4        1        0        0
5        0        1        0